Repository: giellalt/corpus-sme
Catalog: prestable/tmx/nob2sme/facta/skuvlahistorja2/sivras-s.htm.tmx
Source language: sme
Languages: nob

source: Mun liikojin matematihkkii bures , ja muittán oktii go ledjen rehkenastán buot bihtáid mat ledje girjjis ja gádden iežan oažžut ođđa rehketgirjji .
nob: Jeg likte matematikk veldig godt , og jeg husker en gang jeg hadde regnet ut boka og trodde jeg skulle få en ny regnebok .

source: Dan sadjái fertejin álgit ođđasit boares girjjis .
nob: I stedet måtte jeg begynne på nytt i den gamle boka .

source: – Gulaidetgo goassege sámi kultuvrra birra skuvllas ?
nob: – Hørte dere noe om den samiske kulturen på skolen ?

source: – Eat goassege .
nob: – Aldri .

source: Muittán dušše oktii go máttanorgalaš oahpaheaddjirivgu dáhtui min dadjat moadde sáni sámegillii vai son beasai gullat mo giella čuojai .
nob: Jeg husker bare en gang da ei lærerinne sørfra spurte om vi kunne si noen ord på samisk , så hun fikk høre hvordan språket hørtes ut .

source: Dallego Birger váccii skuvlla lei sámegiella ain ealli giellan ja beaivválaš giellan máŋgga báikkis Ruovdevuonas , liikká sámegiella ii hállojuvvon skuvllas iige internáhtas .
nob: Da Birger gikk på skolen var samisk fortsatt et levende språk og dagligspråk i mange hjem i Jarfjord , likevel ble det ikke snakket samisk verken på skolen eller på internatet .

source: Ii oktage oahpaheaddji máhttán sámegiela dan áiggis go Birger váccii skuvlla .
nob: Det var ingen lærere som kunne samisk , den tida Birger gikk på skolen .

source: Internáhtas lei okta sámegielat bargi , muhto ii songe hállan giela barggus .
nob: På internatet var det en ansatt som snakket samisk , men heller ikke hun brukte språket på jobben .

source: Ii mánáid gaskkasge lean dábálaš gullat sámegiela .
nob: Heller ikke barna imellom var det vanlig å høre samisk .

source: Birger muitá ahte dallego fárrii internáhttii maŋŋágo su eadni lei jápmán , de bággejedje muhtin eará mánát su dadjat fasttes sániid sámegillii .
nob: Birger husker at da han flyttet på internatet etter at mora hans døde , ble han truet av noen andre elever til å si stygge ord på samisk .

source: Maŋŋá sii dadjet iežaset áigut almmuhit maid son lei oahpahan sidjiide .
nob: Etterpå sa de at de skulle sladre om hva han hadde lært dem.

source: Dábálaččat hálai Birger sámegiela dušše ovttain eará ohppiin .
nob: Vanligvis snakket Birger samisk kun med én medelev .

source: Eará oahpaheaddjit eai dadjan maidege dasa , muhto rektor roaŋggui sudnuide : – Hálli dárogiela !
nob: De andre lærerne reagerte ikke på dette , men rektor snakket hardt til dem : – Snakk norsk !

source: Mii leat Norggas dál .
nob: Vi er i Norge nå .

source: Skuvlavázzimis ollugat dáruiduvve .
nob: Skolegangen førte til at mange ble fornorsket .

source: Ollugat guđđe maid giláža ja ledje vajáldahttán sámegiela go máhcce ruovttoluotta .
nob: Mange reiste også bort fra bygda og hadde glemt samisk når de kom tilbake igjen .

source: Maiddái sii geat báhce gilážii heite sámásteames .
nob: Også de som ble igjen i bygda sluttet å snakket samisk .

source: Obalohkái lei oaidnu ahte ii lean buorre sámástit , muitala Birger Gustavsen .
nob: Holdninga var jevnt over at det ikke var bra å snakke samisk , forteller Birger Gustavsen .

source: Son muitala iežas maid dovdan heahpatvuođa go bággehalai sámástit áhkuinis eará olbmuid guldaleamis .
nob: Han forteller at også han sjøl i barndommen kjente seg flau over å måtte snakke samisk med bestemora når andre var tilstede .

source: Skuvlavázzima maŋŋá Birger lea hállan sámegiela dušše áibbas moaddásiin iežas ahkásaččaiguin .
nob: Etter at skolegangen var over er det bare et fåtall av sine jevnaldrende Birger har snakket samisk med .

source: Ja dál leat hui uhccán olbmot Ruovdevuonas geat máhttet sámegiela .
nob: Og i dag er det svært få i Jarfjord som kan samisk .

source: Birger vulggii ieš mearaid ala nuorravuođa áiggis .
nob: Birger sjøl reiste til sjøs i ungdomstida .

source: Go máhcai ruoktot guđa jagi maŋŋá , de lei váttis sámástit .
nob: Da han kom hjem etter seks år , var det vanskelig å få til å snakke samisk .

source: Mun áddejin visot , muhto lei váttis oažžut njuokčama časkit , dadjá Birger .
nob: Jeg forstod jo alt , men det var vanskelig å få tunga til å slå , sier Birger .

source: In mun lean geavahan giela buot dáid jagiid .
nob: Jeg hadde jo ikke brukt språket på alle de årene .

source: Áhkku lei loavkašuvvan , son ii máhttán áddet mo olmmoš sáhtii vajáldahttit eatnigiela .
nob: Bestemor var så skuffet , hun kunne ikke forstå hvordan man kunne glemme morsmålet sitt .

source: Muhto áigebottas jietnadeapmi ja hállanvuogit bohte ruovttoluotta .
nob: Men etter en stund kom uttalen og talemåtene tilbake .

source: Maŋimuš jagiid lea Birger oassálastán sámegiela lohkan- ja čállinkursii mii lea lágiduvvon Mátta-Várjjagis .
nob: I løpet av de siste årene har Birger deltatt på lese- og skrivekurs i samisk som er blitt arrangert i Sør-Varanger .

source: – Lei go dát vuosttaš geardi go dus lei oktavuohta sámegiela čállingielain ?
nob: – Var dette aller første gang du kom i kontakt med samisk skriftspråk ?

source: – Áhkus ledje sámegiel biibbal ja sálbmagirji , muhto mun in lohkan daid goassege .
nob: – Bestemor hadde bibel og salmebok på samisk , men jeg leste aldri i dem.

source: Dál mun lean ges ožžon áhku boares biibbala .
nob: Nå har jeg imidlertid fått bestemors gamle bibel .

source: Birger lohká mannat bures lohkat sámegiela , muhto son ii leat áibbas oadjebas sámegiela riektačállimis .
nob: Birger sier det går greit å lese samisk , men at han ikke føler seg helt trygg på samisk rettskrivning .

source: Son lea maid fárus sámi sálbmalávlunjoavkkus Mátta-Várjjagis , ja son láve lohkat biibbalvearssaid girkus .
nob: Han er også med i den samiske salmesanggruppa i Sør-Varanger , og han bruker å lese bibelvers på samisk i kirka .

source: Sutnje ii leat váttis lávlut sámegillii , iige lohkat sámegiela .
nob: Verken synging eller lesing på samisk har han noen problemer med .

source: – Maid don jáhkát sámegiela boahtteáiggi birra Mátta-Várjjagis ?
nob: – Hva tror du om det samiske språkets framtid i Sør-Varanger ?

source: – In mun dieđe maid galggažan dadjat .
nob: – Jeg vet ikke helt hva jeg skal si .

source: Nuorat buolvvas maid muhtimat várra beroštit oahppat giela ja seailluhit dan , muhto eatnašat geat máhttet leat boarrásat dahje gaskaahkásaččat , nu ahte in dieđe lešgo nu nana boahtteáiggi .
nob: Noen er vel interessert i å lære seg det og bevare det av den yngre generasjon også , men de fleste som kan det er jo eldre eller middelaldrende , så jeg vet ikke om det har så stor framtid .

source: Muhto lean positiivvalaččat hirpmástuvvan das ahte nu ollugat hállet sámegiela dán gielddas .
nob: Men jeg er veldig positivt overrasket over at så mange snakker samisk i kommunen .

source: Dál go lea bivnnut máhttit sámegiela , de leat ollugat geat hállet dan , maiddái olbmot geaid in diehtán máhttit sámegiela .
nob: Nå når det er populært å kunne samisk , er det mange som snakker det , også folk jeg ikke ante at kunne samisk .

source: Gunvor Dahl Rasmussen:– Mu ovdamunni lei ahte máhtten čilget áššiid sámegillii .
nob: Gunvor Dahl Rasmussen : – Fordelen min var at jeg kunne forklare ting på samisk

source: Gunvor Dahl Rasmussen lea oahpahan sámegielas ja geavahan sámegiela veahkkegiellan Mátta-Várjjat-skuvllain .
nob: Gunvor Dahl Rasmussen har både undervist i samisk og brukt samisk som hjelpespråk i Sør-Varanger-skolene .

source: Gunvor Dahl Rasmussen lea dán artihkkala čálli ja jorgaleaddji eadni .
nob: Gunvor Dahl Rasmussen er mor til forfatteren og til oversetteren av denne artikkelen .

source: Son lea riegádan 1931:s ja bajásšaddan sámegielat ruovttus Vuonnabađas .
nob: Hun er født i 1931 og oppvokst i et samiskspråklig hjem i Varangerbotn .

source: Su vuođđoskuvlajagit ledje ollásit dárogillii .
nob: Folkeskoleårene hadde vært totalt norskspråklige .

source: Easkka dalle go lei oahppin Sámi nuoraidskuvllas ( álbmotallaskuvllas ) Kárášjogas , de oaččui son oahpahusa sámegielas .
nob: Først da hun var elev på Den samiske ungdomsskolen ( DSF – Den samiske folkehøgskolen ) i Karasjok fikk hun undervisning i samisk språk .

source: Romssa oahpaheaddjiskuvllas sus lei beakkán báhppa ja giellaolmmoš Asbjørn Flokkmann sámegiela oahpaheaddjin .
nob: På lærerskolen fikk hun den kjente presten og språkmannen Asbjørn Flokkmann som samisklærer .

source: Son máhcai Sámi álbmotallaskuvlii oahpaheaddjin ja oahpahii sámegiela .
nob: Etter et par år på lærerskolen kom hun tilbake til DSF som lærer og underviste i samisk språk .

source: Dallego son 1958 čavčča bođii Ruovdevunnii Mátta-Várjjagii , de bođii son sámi gilážii gos dáruiduhttin juo lei garrasit váikkuhan .
nob: Da hun høsten 1958 kom til Jarfjord i Sør-Varanger kom hun til en samisk bygd der fornorskninga hadde gjort et kraftig inntog .

source: Dušše moadde su ahkásaš nuora hálle sámegiela .
nob: Kun noen få ungdommer på hennes egen alder snakka samisk .

source: Buot mánát ledje ovttagielat dárogielhállit .
nob: Alle barna var enspråklige norsktalende .

source: Eanaš váhnemat ledje baicce sámegielhállit .
nob: De fleste av foreldrene var derimot også samisktalende .

source: Ledje maid muhtimat geat máhtte suomagiela , ja muhtimat ledje golmmagielagat .
nob: Det var også de som kunne finsk , og det var noen trespråklige .

source: Ollu váhnemat eai háliidan ahte mánát ohppe sámegiela , dannego alddiset ledje leamaš váttisvuođat skuvllas sámegielhállin .
nob: Mange foreldre ønsket ikke at barna skulle lære samisk , fordi de sjøl som samisktalende hadde hatt problemer på skolen .

source: – Dál maŋit áiggis mii diehtit ahte sivvan dasa lei ahte sis ledje dušše dárogielat oahpaheaddjit , dadjá Gunvor .
nob: - I ettertid vet vi jo at dette kom av at de bare hadde norsktalende lærere , sier Gunvor .

source: 1800-logu gaskamuttu rájes lei maid leamaš stuorra dáža veahkadat . Ruovdevuonas , geat ledje boahtán ovddimusat Østerdalenis ja Trøndelágas .
nob: Fra midten av 1800-tallet av hadde man også fått en stor norsk bosetning i Jarfjord , stort sett fra Østerdalen og Trøndelag .

source: Sii ja sin maŋisboahttit ledje ovttagielat dárogielhállit .
nob: Disse og etterkommerne deres var enspråklig norsktalende .

source: Vaikko dáruiduhttin Ruovdevuonas lei joavdan nu guhkás ahte ii oktage mánná šat hállan sámegiela , de Gunvor oaččui guokte ovttagielat sámegielat oahppi .
nob: Sjøl om fornorskninga i Jarfjord var kommet så langt at ingen unger snakka samisk mer , fikk Gunvor to enspråklig samisktalende elever .

source: Soai leigga currežat ( jumežat ) geat rievtti mielde gulaiga Fossheim skuvlii Njávdámis .
nob: Det var et tvillingpar som egentlig sognet til Fossheim skole i Neiden .

source: Soai leigga álgimin vuosttaš luohkkái , eaba máhttán ovttage dárogiel sáni go bođiiga .
nob: De skulle begynne i første klasse og kunne ikke et ord norsk da de kom .

source: Sudno eadni , guhte lei jierpmálaš ja oaidnilis nisu , lei gullan ahte Tordnii lea boahtán sámegielat oahpaheaddji .
nob: Mora som var en klok og framsynt dame hadde hørt at det var kommet en samisktalende lærer til Tårnet .

source: Son oaivvildii ahte lei buoret jos nieidda guovttos oaččuiga oahpahusa olbmos guhte máhtii sámegiela .
nob: Hun mente det var best om jentene fikk undervisning av en som kunne samisk .

source: Máŋgga ášši dáfus lei dát eadni ovddabealde iežas áiggi , son oaivvildii ahte mánát galge oahppat dárogiela , seammás go lei dehálaš ahte sii seailluhedje sámegiela .
nob: På mange måter var denne mora forut for sin tid , hun mente at barna skulle lære norsk , samtidig som det var viktig at de bevarte det samiske språket .

source: Nieidda guovttos leigga nuoramusat stuorra mánnáčorragis , nu ahte eadneolbmos lei guhkit áiggi vásáhus dáinna ahte sáddet mánáid dárogielat internáhttaskuvlii .
nob: Disse var de yngste i en stor barneflokk , så mora hadde lang erfaring med å sende barna sine fra seg på norskspråklig internatskole .

source: Muhtimiidda su mánáin lei leamaš váttis oahppat dárogiela , juoidá mii eatni mielas bođii das ahte oahpaheaddjit eai máhttán sámegiela .
nob: Flere av de andre barna hennes hadde hatt problemer med å lære norsk , noe hun bestemt mente kom av at lærerne ikke beherska samisk .

source: Gunvora ovdamunni sámegielhállin lei ahte son máhtii čilget áššiid máná guoktái sámegillii ja seammás muitalit sudnuide mii dat lei dárogillii .
nob: Gunvors fordel som samisktalende var at hun kunne forklare barna ting på samisk og samtidig fortelle dem hva det het på norsk .

source: Maŋit áiggis oaivvildii máná guoktá eadni ahte buot iežas mánáin , de leigga currežat oahppan dárogiela johtilepmosit ja čielgasepmosit .
nob: I ettertid mente barnas mor at av alle ungene hennes var det tvillingene som hadde lært norsk fortest og reinest .

source: Lei dušše sáhka njálmmálaš sámegielas , veahkkegiellan , vai soai oahpaiga dárogiela .
nob: Det var bare snakk om muntlig samisk , som et hjelpespråk for at de skulle lære norsk .

source: Dan áiggis eai lean álgán geavahit čálalaš sámegiela skuvllas .
nob: På denne tida var det ikke innført skriftlig samisk i skolen .

source: G. b. Skuvlamánát duhkoraddamin Toartna skuvlla olggobealde .
nob: T.v. : Skolebarn i lek utenfor Tårnet skole .

source: ( Govva : Gunvor Dahl Rasmussen )
nob: ( Foto : Gunvor Dahl Rasmussen )

source: O. b. Gunvor Dahl Rasmussen Toartna skuvlla luohkáin .
nob: T.h. : Gunvor Dahl Rasmussen sammen med en skoleklasse på Tårnet skole .

source: ( Gova luoikan Gunvor Dahl Rasmussen )
nob: ( Foto utlånt av Gunvor Dahl Rasmussen )

source: Njealji jagi barggu maŋŋá Toartna skuvllas Gunvor sirddii Kirkonjárgga skuvlii .
nob: Etter fire år på Tårnet skole flyttet Gunvor til Kirkenes skole .

source: Ii dáppe , iige Johkanjárgga iige Guvžajávrri skuvllas gos maŋŋá oahpahii , lean mangelágan sámegieloahpahus , iige lean goassege sáhka ahte oktage livččii dárbbašan sámegiela veahkkegiellan .
nob: Verken her eller på Elvenes og Bjørnevatn skoler som hun seinere underviste på , foregikk det noen samiskundervisning og det var heller aldri snakk om at noen kunne ha bruk for samisk som hjelpespråk .

source: Easkka 1980-logu gaskkamuttus Gunvor álggii oahpahit sámegiela Kirkonjárgga nuoraidskuvllas ja Kirkonjárgga joatkkaskuvllas , maŋŋá go ieš lei lohkan sámegiela vuođđofága Romssa universitehtas .
nob: Først på midten av 1980-tallet begynte Gunvor igjen å undervise i samisk på Kirkenes ungdomsskole og Kirkenes videregående skole , etter å ha lest samisk grunnfag på Universitetet i Tromsø .

source: Dat lei uhca jovkkoš mas ledje guokte , golbma oahppi .
nob: Dette var en liten gruppe på 2–3 elever .

source: Oahppit bohte sámegielat ruovttuin , dahje goitge lei sis okta sámegielat váhnen , ja ledje fárren juogo Kárášjogas , Deanus dahje Unjárggas .
nob: Elevene kom fra samisktalende hjem , eller i hvert fall hadde én samisktalende forelder , og var kommet flyttende fra Karasjok , Tana eller Nesseby .

source: Ain golle máŋga jagi ovdalgo fállojuvvui sámegieloahpahus maiddái ohppiide geat eai máhttán juo sámegiela .
nob: Fortsatt skulle det ta mange år før det ble gitt tilbud om samiskundervisning også til elever som ikke kunne samisk fra før .

source: Maŋŋá lean gullan ahte earát maid livčče háliidan sámegieloahpahusa , dadjá Gunvor , muhto dat ožžo vástádussan skuvllas ahte oahpaheaddjit eai gávdnon . Dattetge mus ii jerrojuvvon oahpahit eanet joavkkuid .
nob: – I ettertid har man jo hørt om flere som ønsket samiskundervisning , sier Gunvor , men som fikk som svar fra skolene at det ikke fantes lærere , likevel ble jeg ikke forespurt om å påta meg flere grupper .

source: Britt Erna Christensen : – Mun dáhtton ieš sámegieloahpahusa
nob: Britt Erna Christensen : – Jeg spurte sjøl etter samiskundervisning

source: Britt Erna Christensen gáibidii ovccejáhkasažžan sámegieloahpahusa .
nob: Britt Erna Christensen forlangte som niåring å få samiskundervisning .

source: Dá nieiddažiinnis , Marikain .
nob: Her med sin lille datter , Marika .

source: Mun deaivvan Britt Erna Christensena mánnávuođabáikkis aiddo Guvžajávrri lahka , gos son ássá ovttas iežas njuoratmánáin ja váhnemiiguin .
nob: Jeg treffer Britt Erna Christensen i barndomshjemmet like utenfor Bjørnevatn , der hun bor sammen med den nyfødte dattera si og foreldrene sine .

source: Britt Erna lea 21-jahkásaš ja ovddasta máŋgga ášši dáfus Mátta-Várjjaga sápmelaččaid nuorat buolvva .
nob: Britt Erna er 21 år og representerer på mange måter den unge generasjonen av Sør-Varanger-samer .

source: Britt Erna lea daid vuosttaš ohppiid gaskkas geat eai máhttán sámegiela , muhto ožžo sámegieloahpahusa skuvllas .
nob: Britt Erna var blant de første ikke-samisktalende som fikk samiskundervisning på skolen .

source: Ii goabbáge váhnen hála sámegiela , vaikko su eadni guhte lea Ráttovuonas eret Deanus , lea sápmelaš .
nob: Ingen av hennes foreldre snakker samisk , sjøl om mora som er fra Smalfjord i Tana er same .

source: Eatni váhnemat oaivvildeigga dego nu ollu earát dán buolvvas , ahte mánáide šaddá geahppaset skuvlavázzin ja buoret vejolašvuođat virggi válljemis jos sii šaddet ovttagielat dárogielhállin .
nob: Mora sine foreldre mente som så mange andre av deres generasjon at barna deres ville få en lettere skolegang og bedre muligheter for valg av yrke om de var ettspråklig norsktalende .

source: Sámegillii ii lean dárbu .
nob: Samisk hadde de ikke behov for .

source: Britt Erna lea čađahan buot skuvlavázzima Mátta-Várjjaga skuvllain .
nob: Britt Erna har hatt hele skolegangen sin på skoler i Sør-Varanger .

source: Mánáidskuvlla son váccii Goađáin .
nob: Barneskolen gikk hun på Sandnes .

source: Doppe son oaččui sámegieloahpahusa goalmmát luohká loahpas ja njealját ja viđát luohkás .
nob: Der fikk hun samiskundervisning på slutten av 3. klasse , og i 4. og 5. klasse .

source: – Ieš mun jearrahišgohten sámegiel oahpahusa birra , muitala Britt Erna .
nob: – Det var jeg sjøl som begynte å spørre etter samiskundervisning , forteller Britt Erna .

source: Muhtin mánáin lei oahpahus suomagielas dannego sin váhnemat ledje Suomas eret .
nob: Det var noen barn som hadde undervisning i finsk fordi foreldrene deres var fra Finland .

source: Manne mii eat sáhttán oažžut sámegiela ?
nob: Hvorfor kunne ikke vi også få samisk ?

source: Britt Erna eadni , Erna Christensen , muitala Britt Ernas leamaš beroštupmi oahppat sámegiela ja ahte son lea áššis dorjon nieiddas .
nob: Britt Ernas mor , Erna Christensen , forteller at Britt Erna var interessert i å lære samisk og at hun har støttet henne i dette .

source: Sámegiel joavkkus Goađáid skuvllas leigga ovddimusat Britt Erna ja okta eará nieida .
nob: Samiskgruppa på Sandnes bestod stort sett av Britt Erna og ei anna jente .

source: Sudnos lei nana mokta oahppat sámegiela .
nob: Disse to var svært motiverte til å lære samisk .

source: Muhtin áigodagain biddjui sudno oahpahus oktii Guvžajávrri skuvlla sámegiel fálaldagain , dalle nieidda guovttos vácciiga Goađáin Guvžajávrái .
nob: I noen perioder ble undervisninga slått sammen med Bjørnevatn skoles samisktilbud , da gikk de to jentene fra Sandnes til Bjørnevatn .

source: Britt Erna jotkkii sámegieloahpahusas Guvžajávrri nuoraidskuvllas .
nob: Britt Erna fortsatte med samiskundervisning på ungdomsskolen i Bjørnevatn .

source: Dalle sii ledje ges golbma , njeallje oahppi joavkkus .
nob: Nå var de 3–4 elever i gruppa .

source: Sámegieldiimmuin ii lean dušše sámegiella , oahpaheaddji lasihii maid eará fáttáid sámi kultuvrra siskkobealde , ovdamearkka dihte oahppit ohppe ráhkadit biđđosa .
nob: Samisktimene bestod ikke bare av samisk språk , læreren flettet også inn emner innenfor samisk kultur , for eksempel lærte elevene å lage bidus .

source: Go veaháš áigi lei gollan , de buohccái dađe bahát oahpaheaddji , juoidá mii dagahii ahte eanaš áiggi ii lean mihkkege sámegieloahpahusaid .
nob: Etter en tid ble dessverre samisklæren syk , noe som førte til at det stort sett ikke var noen samiskundervisning .

source: Goađáid skuvllas lei sámegieloahpahus lágiduvvon nu ahte oahppit guđđe dábálaš diimmuid moadde diimmu vahkus .
nob: På Sandnes skole hadde undervisninga i samisk vært organisert på den måten at elevene gikk ut fra de vanlige timene et par timer i uka .

source: Guvžajávrris sámegiella jorai ges áiggi mielde válljenfágan , juoidá mii mielddisbuvttii ahte oahppit geat dáhtto sámegieloahpahusa eai sáhttán válljet eará válljenfágaid , earret eará tuiskkagiela .
nob: I Bjørnevatn ble samisk etterhvert et valgfag , noe som førte til at elever som ønsket samiskundervisning ikke kunne velge andre valgfag , blant annet tysk .

source: Britt Erna vásihii dán vuoigatmeahttumin , dannego son lei juo álgán lohkat duiskkagiela ja áinnas háliidii joatkit dan giela oahppat sámegiela lassin .
nob: Britt Erna opplevde dette som veldig urimelig , da hun hadde begynt på tysk og gjerne ville fortsette med dette språket i tillegg til samisk .

source: Dallego bággehalai válljet , de válljii joatkit sámegiela lohkat .
nob: Da hun ble nødt til å velge , valgte hun å fortsette med samisk .

source: Nuoraidskuvlla maŋimuš jagi addojuvvui sámegiel fálaldat dábálaš skuvlaáiggi maŋŋá .
nob: Det siste året på ungdomsskolen ble samisktilbudet lagt til etter den ordninære skoletida .

source: Skuvlabeaivi álggahuvvui diibmu 0750 ja lei olles gávcci diimmu , dan maŋŋá álggii ges sámegieloahpahus .
nob: Skoledagen begynte klokka 0750 og var på hele åtte timer , deretter begynte altså samiskundervisninga .

source: Sihke Britt Erna ja su eadni dovddaheaba ahte lei menddo lossat logát luohkálaččaide .
nob: Både Britt Erna og mora gir uttrykk for at dette var altfor slitsomt for 10. klassinger .

source: Goappašagat oaivvildeaba ahte sámegieloahpahus lei oalle muddui skuvlajođiheaddjiid dáhtu duohken fállat sámegieloahpahusa .
nob: Begge mener dette hadde mye med skoleledelsens vilje til å gi et tilbud om samiskundervisning .

source: Soai muitaleaba dalá rektora dadjan njuolga ohppiide ahte sii eai dárbbašan sámegiela .
nob: De forteller at daværende rektor sa direkte til elevene at de ikke hadde bruk for samisk .

source: Vaikko oahpahusfálaldat ja eandalit oahpahusa lágideapmi ii lean álo buot buoremus vuođđoskuvllas , de lea Britt Erna duđavaš dainna ahte son lea ožžon vejolašvuođa lohkat sámegiela ja oaivvilda iežas ja eará ohppiid leat šaddan oalle čeahppin dáid jagiid .
nob: Til tross for at undervisningstilbudet og særlig organiseringa av det ikke alltid var det aller beste i grunnskolen , er Britt Erna fornøyd med at hun fikk denne muligheten til å lese samisk og mener at hun og medelevene var blitt ganske flinke i løpet av disse årene .

source: Dallego son álggii joatkkaskuvlii , de háliidii oahppat eambbo sámegiela , muhto doppe ii lean fálaldat heivehuvvon su dássái .
nob: Da hun begynte på videregående skole ønsket hun å lære mer samisk språk , men her var ikke tilbudet tilpasset hennes nivå .

source: Fállojuvvui dušše oahpahus sámegielas vuosttašgiellan ja nubbingiellan .
nob: Det ble kun gitt undervisning i samisk som 1. og 2. språk .

source: Dát oahpahus lei oaivvilduvvon ohppiide geain lei sámegiella juogo eatnigiellan dahje geain lei leamaš ollu eanet sámegieloahpahus vuođđoskuvllas go dat maid Britt Ernas lei leamaš .
nob: Dette var undervisning beregnet på elever som enten hadde samisk som morsmål eller som hadde hatt mye mer samiskundervisning i grunnskolen enn det Britt Erna hadde hatt .

source: Buot oahpahus lei sámegillii , ja eanaš oahppit dán joavkkus ledje sámegielagat Kárášjogas ja Deanus eret .
nob: Her foregikk all undervisning på samisk og gruppa bestod i stor grad av samisktalende elever fra Karasjok og Tana .
